In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.read_csv('Churn_Modelling.csv')

In [3]:
df.columns

Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')

In [5]:
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler

In [6]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [ ]:
# Normalization

### Min-Max Scaler

Min-Max Scaler is a normalization technique used to scale data to a fixed range, usually **[0, 1]**.

#### Formula:

    X_scaled = (X - X_min) / (X_max - X_min)

- **X**: Original value  
- **X_min**: Minimum value in the feature  
- **X_max**: Maximum value in the feature  
- **X_scaled**: Scaled value between 0 and 1

#### Example:
If a feature has values ranging from 10 to 50 and the value is 30:

    X_scaled = (30 - 10) / (50 - 10) = 20 / 40 = 0.5

In [8]:
new_df = pd.DataFrame(df,columns=['Age','Tenure'])

In [9]:
new_df.head()

   Age  Tenure
0   42       2
1   41       1
2   42       8
3   39       1
4   43       2

In [12]:
new_df.info()
# Np null Value

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     10000 non-null  int64
 1   Tenure  10000 non-null  int64
dtypes: int64(2)
memory usage: 156.4 KB

In [15]:
scaler = MinMaxScaler()
#Instanting the MinMaxScaler() functions

In [16]:
normalized_df =scaler.fit_transform(new_df)

In [17]:
normalized_df

array([[0.32432432, 0.2       ],
       [0.31081081, 0.1       ],
       [0.32432432, 0.8       ],
       ...,
       [0.24324324, 0.7       ],
       [0.32432432, 0.3       ],
       [0.13513514, 0.4       ]])